**free
///
// @brief COMMON
// @info Resources shared by every API
// 
// @project FREESYSINC
// @author kokuen
// @version 7.1
///




// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Exports & Imports
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/DEFINE common


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Constants
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


// Sizes
dcl-c INT3_MAX 127;
dcl-c INT5_MAX 32767;
dcl-c INT10_MAX 2147483647;
