**free
///
// @brief COMMON
// @info Resources shared by every API
// 
// @project QAPIFREE
// @author kokuen
// @version 7.1
///




// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Exports & Imports
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/DEFINE api_common


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Constants
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


// Sizes
dcl-c INT3_MAX 127;
dcl-c INT5_MAX 32767;
dcl-c INT10_MAX 2147483647;

dcl-c UNS3_MAX(255);
dcl-c UNS5_MAX(65535);